---
kind: method
id: M:Autodesk.Revit.DB.UpdaterRegistry.GetRegisteredUpdaterInfos
source: html/1cf828fd-f6f4-56cd-c428-b957fcf912ff.htm
---
# Autodesk.Revit.DB.UpdaterRegistry.GetRegisteredUpdaterInfos Method

Returns UpdaterInfos for all the application-wide updaters.

## Syntax (C#)
```csharp
public static IList<UpdaterInfo> GetRegisteredUpdaterInfos()
```

## Returns
List of UpdaterInfo structures